<?php

namespace Database\Seeders;

use App\Models\Region;
use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    private array $regions;

    public function __construct()
    {
        $this->regions = [
            [
                'name' => 'Алматы',
                'cities' => [
                    'Алматы'
                ]
            ],
            [
                'name' => 'Астана',
                'cities' => [
                    'Астана' // TODO
                ]
            ],
            [
                'name' => 'Шымкент',
                'cities' => [
                    'Шымкент'
                ]
            ],
            [
                'name' => 'Алматинская область',
                'cities' => [
                    'Талдыкорган',
                    'Каскелен',
                    'Капшагай',
                    'Талдыкорган',
                    'Жаркент',
                    'Талгар',
                    'Текели',
                    'Есик',
                    'Уштобе',
                    'Ушарал',
                    'Сарканд'
                ]
            ],
            [
                'name' => 'Акмолинская область',
                'cities' => [
                    'Кокшетау',
                    'Щучинск',
                    'Степногорск',
                    'Атбасар',
                    'Макинск',
                    'Акколь',
                    'Есиль',
                    'Ерейментау',
                    'Державинск',
                    'Степняк'
                ]
            ],
            [
                'name' => 'Атырауская область',
                'cities' => [
                    'Атырау',
                    'Кульсары'
                ]
            ],
            [
                'name' => 'Актюбинская область',
                'cities' => [
                    'Актобе',
                    'Кандыагаш',
                    'Шалкар',
                    'Хромтау',
                    'Алга',
                    'Эмба',
                    'Темир',
                    'Жем'
                ]
            ],
            [
                'name' => 'Восточно-Казахстанская область',
                'cities' => [
                    'Усть-Каменогорск',
                    'Семей',
                    'Риддер',
                    'Аягоз',
                    'Алтай',
                    'Шемонаиха',
                    'Зайсан',
                    'Курчатов',
                    'Серебрянск',
                    'Шар'
                ]
            ],
            [
                'name' => 'Жамбылская область',
                'cities' => [
                    'Тараз',
                    'Шу',
                    'Каратау',
                    'Жанатас'
                ]
            ],
            [
                'name' => 'Западно-Казахстанская область',
                'cities' => [
                    'Уральск',
                    'Аксай'
                ]
            ],
            [
                'name' => 'Карагандинская область',
                'cities' => [
                    'Караганда',
                    'Темиртау',
                    'Жезказган',
                    'Балхаш',
                    'Сатпаев',
                    'Сарань',
                    'Шахтинск',
                    'Абай',
                    'Приозёрск',
                    'Каркаралинск',
                    'Каражал'
                ]
            ],
            [
                'name' => 'Костанайская область',
                'cities' => [
                    'Костанай',
                    'Рудный',
                    'Лисаковск',
                    'Жетикара',
                    'Аркалык',
                    'Тобыл'
                ]
            ],
            [
                'name' => 'Кызылординская область',
                'cities' => [
                    'Кызылорда',
                    'Байконур',
                    'Аральск',
                    'Казалинск'
                ]
            ],
            [
                'name' => 'Мангистауская область',
                'cities' => [
                    'Актау',
                    'Жанаозен',
                    'Форт-Шевченко',
                ]
            ],
            [
                'name' => 'Павлодарская область',
                'cities' => [
                    'Павлодар',
                    'Экибастуз',
                    'Аксу',
                ]
            ],
            [
                'name' => 'Северо-Казахстанская область',
                'cities' => [
                    'Петропавловск',
                    'Тайынша',
                    'Булаево',
                    'Сергеевка',
                    'Мамлютка'
                ]
            ],
            [
                'name' => 'Туркестанская область',
                'cities' => [
                    'Туркестан',
                    'Кентау',
                    'Арыс',
                    'Сарыагаш',
                    'Шардара',
                    'Жетысай',
                    'Ленгер',
                ]
            ],
        ];
    }

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        if (Region::count() == 0)
            foreach ($this->regions as $region) {
                $regionModel = Region::create([
                    'name' => $region['name']
                ]);

                $citySeeder = new CitySeeder($region['cities'], $regionModel->id);
                $citySeeder->run();
            }
    }
}
